app/views/messages/_message_form.html.erb

    <%= f.label :to %>
    <%= f.collection_select(:receive_id, User.all, :id, :name, :include_blank => "Please select") %>
---
SELECT "users".* FROM "users"