app/views/users/show.html.erb

SELECT  1 AS one FROM "comments"  WHERE "comments"."user_id" = ? LIMIT 1  [["user_id", 1]]
---
    <%= render 'follow_form' if signed_in? %>
    <% if @user.comments.any? %>