app/controllers/comments_controller.rb

SELECT  "movies".* FROM "movies"  WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("body", "created_at", "movie_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "das"], ["created_at", "2014-11-23 15:46:10.737628"], ["movie_id", 1], ["updated_at", "2014-11-23 15:46:10.737628"], ["user_id", 1]]
---
	def create
                @movie = Movie.find(params[:movie_id])
                @comment = @movie.comments.build(comment_params)
                @comment.movie = @movie
                @comment.user = current_user
                @comment.save

SELECT  "movies".* FROM "movies"  WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "comments".* FROM "comments"  WHERE "comments"."id" = ?  ORDER BY comments.created_at DESC LIMIT 1  [["id", 2]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 3]]
---
    def destroy
        @movie = Movie.find(params[:movie_id])
        @comment = Comment.find(params[:id])
        @comment.destroy