app/controllers/messages_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
---
  def find_receive_id
    @user = User.find(params[:user_id])