app/controllers/messages_controller.rb

INSERT INTO "messages" ("content", "created_at", "receive_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "dddd"], ["created_at", "2015-02-02 15:50:17.656563"], ["receive_id", 2], ["updated_at", "2015-02-02 15:50:17.656563"], ["user_id", 2]]
---
  def create
    @message = current_user.messages.build(message_params)

    if @message.save

SELECT  "messages".* FROM "messages"  WHERE "messages"."id" = ? LIMIT 1  [["id", 1]]
---
  def reply
    @message_to_reply = Message.find(params[:id])

SELECT "messages".* FROM "messages"  WHERE "messages"."receive_id" = ?  [["receive_id", 2]]
SELECT COUNT(*) FROM "messages"  WHERE "messages"."receive_id" = ?  [["receive_id", 2]]
---
    def set_message_counts
      @inbox_count ||= current_user.received_messages.size