app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies"
---
  def index

    @movies = Movie.paginate(:per_page => 10,page: params[:page])

SELECT  "movies".* FROM "movies"  WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT "comments".* FROM "comments"  WHERE "comments"."movie_id" = ?  ORDER BY comments.created_at DESC  [["movie_id", 1]]
---
  def show
  if current_user
    @rating = Rating.where(movie_id: @movie.id, user_id: current_user.id).first
  unless @rating
    @rating = Rating.create(movie_id: @movie.id, user_id: current_user.id, score: 0)
  end
  end
  @movie = Movie.find(params[:id])
  @comments = @movie.comments.paginate(:per_page => 10,page: params[:page])

INSERT INTO "movies" ("actors", "content", "created_at", "date", "director", "duration", "genre", "imdb", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
   # @movie = Movie.new(movie_params)
    @movie = Movie.create(movie_params)

SELECT  "movies".* FROM "movies"  WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "movies" SET "image_content_type" = ?, "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "movies"."id" = 1
---
  def update
    @movie = Movie.find(params[:id])
    @movie.update(:image => params[:movie][:image])