app/controllers/static_pages_controller.rb

SELECT  "comments".* FROM "comments"  WHERE (user_id IN (SELECT followed_id FROM relationships
SELECT  "microposts".* FROM "microposts"  WHERE (user_id IN (SELECT followed_id FROM relationships
SELECT COUNT(*) FROM "comments"  WHERE (user_id IN (SELECT followed_id FROM relationships
SELECT COUNT(*) FROM "microposts"  WHERE (user_id IN (SELECT followed_id FROM relationships
---
  def home
  	if signed_in?
      @micropost  = current_user.microposts.build
  	  @comment  = current_user.comments.build
      @feed_items = current_user.feed.paginate(:per_page => 5,page: params[:page])