app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @microposts = @user.microposts
    @comments = @user.comments.paginate(page: params[:page])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "comments".* FROM "comments"  WHERE "comments"."user_id" = ?  ORDER BY comments.created_at DESC  [["user_id", 1]]
SELECT "microposts".* FROM "microposts"  WHERE "microposts"."user_id" = ?  ORDER BY microposts.created_at DESC  [["user_id", 1]]
SELECT COUNT(*) FROM "comments"  WHERE "comments"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "microposts"  WHERE "microposts"."user_id" = ?  [["user_id", 1]]

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "password_digest" = ?, "remember_token" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["password_digest", "$2a$10$8Glnwq4s4J3dooYysXwAwupyxj9GxCvNaahZQQQGFhOItzszuGai6"], ["remember_token", "bPp5AjxTYPf6UxPp3NJMmg"], ["updated_at", "2014-11-10 20:41:32.488211"]]